some modifications in readme file
